tasks.tex
% Created 2020-10-11 Вс 15:51
% Intended LaTeX compiler: xelatex
\documentclass{extarticle}
                

\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{breqn}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{polyglossia}
\setmainlanguage{russian}
\setotherlanguage{english}
\setkeys{russian}{babelshorthands=true}
\PolyglossiaSetup{russian}{indentfirst=true}
\usepackage{fontspec}
\setmainfont{Liberation Serif}
\usepackage{minted}
\usepackage[left=4cm,right=4cm, top=2cm,bottom=2cm,bindingoffset=0cm]{geometry}
\usepackage{xcolor}
\PassOptionsToPackage{final}{graphicx}
\usepackage{caption}
\usepackage{subcaption}
\usepackage{wrapfig}
\usepackage{array}
\usepackage{multirow}
\usepackage{makecell}
\definecolor{friendlybg}{HTML}{f0f0f0}
\date{}
\title{Задачи на графы}
\hypersetup{
 pdfauthor={},
 pdftitle={Задачи на графы},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={Russian}}
\begin{document}



\section*{Задача 1}
\label{sec:org8e63e1a}
\subsection*{Постановка}
\label{sec:org78fc404}

Задан неорентированный граф.
Необходимо найти степени всех его
вершин.

\subsection*{Входные данные}
\label{sec:org68b1a8d}

В первой строке содержатся два целых числа
\(n\) и \(m\)
(\(1 \leq n \leq 105\), \(0 \leq m \leq 105\)),
где \(n\) — количество вершин в графе, \(m\) — количество рёбер в графе.

В следующих \(m\) строках записаны рёбра, по одному ребру в строке.
Каждое ребро - два числама \(u\) и \(v\) (\(1 \leq u\), \(v \leq n\)),
начало ребра и конец ребра соответственно.

Граф без петель и кратных рёбер.

\subsection*{Выходные данные}
\label{sec:org65da6f1}

Выведите \(n\) целых чисел, где \(i\text{-е}\) число является степенью
\(i\text{-й}\) вершины графа.

\subsection*{Пример 1}
\label{sec:org62f7e4c}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
5 6\\
1 2\\
2 3\\
3 1\\
4 3\\
5 4\\
5 2
}
&
\makecell[l]{
2 3 3 2 2
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\subsection*{Пример 2}
\label{sec:orgf460131}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
2 1\\
1 2
}
&
\makecell[l]{
1 1
}
\\ \hline

\end{tabular}
\end{center}
\end{table}
\pagebreak

\section*{Задача 2}
\label{sec:orgcfafb33}
\subsection*{Постановка}
\label{sec:org9cbb325}

Постройте \(k\text{-регулярный}\) неориентированный граф из \(n\) вершин.
Если это невозможно, то укажите это.

\subsection*{Входные данные}
\label{sec:org25df960}

На вход подаётся два числа \(n\) и \(k\) (\(1 \leq n,k \leq200\)).

\subsection*{Выходные данные}
\label{sec:orgf6426c7}

\begin{itemize}
\item если существуте, то вывести количество рёбер в графе и
ребра в следующих строках.
\item если не существует, то выведите None.
\end{itemize}

\subsection*{Пример 1}
\label{sec:orgc3a24e1}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
3 2
}
&
\makecell[l]{
3\\
1 2\\
2 3\\
3 1
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\subsection*{Пример 1}
\label{sec:org02669b4}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
5 3
}
&
\makecell[l]{
None
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\pagebreak
\section*{Задача 3}
\label{sec:org987af50}
\subsection*{Постановка}
\label{sec:org0471d53}

Постройте наименьший по количеству дуг
непустой ориентированный граф, такой что
степень исхода каждой вершины равна \(d_{1}\), а степень
входа равна \(d_{2}\).

\subsection*{Входные данные}
\label{sec:orgcbb2b9b}

На вход подаются
два целых числа \(d_{1}\) и \(d_{2}\) (\(1 \leq d1, d2 \leq 100\)) -
степень исхода и степень входа каждой вершины соответственно.

\subsection*{Выходные данные}
\label{sec:orgeb48d01}

\begin{itemize}
\item если существуте, то вывести в первой строке
количество вершин и дуг искомого графа.
А в остальных строках пары дуг.
\item если не существует, то выведите None.
\end{itemize}

\subsection*{Пример 1}
\label{sec:orgaa5b3e6}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
2 2
}
&
\makecell[l]{
2 4\\
1 1\\
1 2\\
2 1\\
2 2
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\subsection*{Пример 2}
\label{sec:org5218e00}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
1 2
}
&
\makecell[l]{
None
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\pagebreak
\section*{Задача 4}
\label{sec:org90e4fe0}
\subsection*{Постановка}
\label{sec:org83260bb}

Вам заданы неориентированный граф списком его рёбер и множество вершин.
Необходимо проверить можно ли выбрать подмножество компонент связности так,
что заданные вершины являются всеми вершинами этого подмножества компонент (и только ими).

\subsection*{Входные данные}
\label{sec:org6763b5e}

В первой строке содержатся количество вершин в графе (\(n\)),
количество рёбер (\(m\)) и количество вершин в множестве (\(k\)).

В следующей строке \(k\) целых чисел - заданное множество вершин.

В следующих \(m\) строках записаны рёбра, по одному ребру в строке.

Граф без петель и кратных рёбер.

\subsection*{Выходные данные}
\label{sec:orga84562e}

\begin{itemize}
\item True - если заданные вершину оразуют одну или более компоненту связности.
\item False - в противном случае
\end{itemize}

\subsection*{Пример 1}
\label{sec:orgb04de1a}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
4 3 3\\
1 2 3\\
1 2\\
2 3\\
1 3
}
&
\makecell[l]{
True
}
\\ \hline

\end{tabular}
\end{center}
\end{table}

\subsection*{Пример 2}
\label{sec:org92f3ad3}

\begin{table}[H]
\begin{center}
\begin{tabular}{|m{4cm}|m{4cm}|}
\hline
Входные данные & Выходные данные \\ \hline
\makecell[l]{
4 2 3\\
1 2 3\\
1 2\\
3 4
}
&
\makecell[l]{
False
}
\\ \hline

\end{tabular}
\end{center}
\end{table}
\end{document}
